
## Plan Result (curated-corpus-api-cdk-production)

[CI link](https://github.com/Pocket/content-monorepo/actions/runs/15327516681)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1 must be replaced
-/+ resource "aws_secretsmanager_secret_version" "rds_rds_secret_version_11D8C2B1" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:996905175585:secret:CuratedCorpusAPI-Prod/curatedcorpusapi-prod20210927235441510200000001-9IpWYR" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:996905175585:secret:CuratedCorpusAPI-Prod/curatedcorpusapi-prod20210927235441510200000001-9IpWYR|50CE64F2-F4DF-4E84-9363-70D95CBF264D" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "50CE64F2-F4DF-4E84-9363-70D95CBF264D" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":297,"Program":"tfcmt","SHA1":"7128685a3321c6e50372867df68d27f1a6332452","Target":"curated-corpus-api-cdk-production","Vars":{},"WorkflowName":"Curated Corpus API"} -->